# 8 딕셔너리를 이용한 문제맞추기 게임

problems = {"파이썬": "최근에 가장 떠오르는 프로그래밍 언어", 
            "변수": "데이터를 저장하는 메모리 공간", 
            "리스트": "서로 관련이 없는 항목들의 모임", 
            "함수": "작업을 수행하는 문장들의 집합에 이름을 붙인 것"}

for word in problems.keys():  # ['파이썬', '변수', '리스트', '함수'] 로 이루어진 리스트를 순회하는 셈이다.
    print("다음은 어떤 단어에 대한 설명일까요? (단어로 쓰세요.)")
    print(problems[word])   # value(문제) 출력
    print("(1)파이썬  (2)함수  (3)리스트  (4)변수")
    ans = input()
    if ans == word:
        print("정답입니다!")
    else:
        print("틀렸습니다.")
        print("정답은", word, "입니다.")
        
