# 6 입력받은 정수의 나눗셈에서 나머지가 없는지~

num = int(input("정수를 입력하세요.: "))

if num % 2 == 0 and num % 3 == 0:   # 2로 나눈 나머지 = 0 그리고 3으로 나눈 나머지 = 0
    print("2와 3으로 나누어 떨어지는 수입니다.")
    
elif num % 2 == 0 and num % 3 != 0: # 2로 나눈 나머지 = 0 그리고 3으로 나눈 나머지는 0이 아님
    print("2로 나누어 떨어지는 수입니다.")
    print("3으로는 나누어 떨어지지 않습니다.")
    
elif num % 2 != 0 and num % 3 == 0: # 2로 나눈 나머지는 0이 아니고 3으로 나눈 나머지 = 0
    print("3으로 나누어 떨어지는 수입니다.")
    print("2로는 나누어 떨어지지 않습니다.")
    
else:   # 모두 나누어 떨어지지 않음
    print("2와 3으로 나누어 떨어지지 않습니다.")